[
    {
        "id": "0",
        "productName": "Huawei MateBook X Pro",
        "image": "huawei-matebook-pro.jpg",
        "cpu": "Intel Core i7, 8th generation",
        "ram": "8GB",
        "storage": "512 GB SSD",
        "screen": "13.9-inch, 3K (3,000 x 2,080)",
        "price": "1499",
        "description": "The Huawei MateBook X Pro is our pick for the best laptop money can buy in 2018. This is a gorgeously-designed laptop with a stunning screen (albeit with a rather odd aspect ratio), and it comes packed with cutting edge components that allows it to perform brilliantly, and a battery life that runs rings around many of its rivals. It also has a very competitive price, giving you features, design and performance for quite a bit less money.",
        "rating": 4.5
    },
    {
        "id": "1",
        "productName": "Apple Macbook Pro 2018",
        "image": "macbook-pro-15.jpg",
        "cpu": "6-core Intel i7, 8th generation",
        "ram": "16GB",
        "storage": "1TB GB SSD",
        "screen": "15-inch Retina display",
        "price": "3199",
        "description": "If you're after the latest and greatest laptop from Apple, we suggest you look into the 2018 model of the 15-inch MacBook Pro with Touch Bar. The headline Touch Bar – a thin OLED display at the top of the keyboard which can be used for any number of things, whether that be auto-suggesting words as you type or offering Touch ID so you can log in with just your fingerprint – is of course included. It's certainly retained Apple's sense of style, but it comes at a cost. This is a pricey machine, so you may want to consider one of the Windows alternatives. But, if you're a steadfast Apple diehard, this is definitely the best laptop for you!",
        "rating": 4.7
    },
    {
        "id": "2",
        "productName": "Dell XPS 13",
        "image": "dell-xps-13.jpg",
        "cpu": "Intel Core i7, 8th generation",
        "ram": "16GB",
        "storage": "512 GB SSD",
        "screen": "13.3-inch, Full HD",
        "price": "1199",
        "description": "The Dell XPS 13 is an absolutely brilliant laptop. The 2018 version rocks an 8th-generation Intel Core i5 or i7 processor and a bezel-less ‘Infinity Edge’ display, this Dell XPS 13 continues to be the most popular Windows laptop in the world. What’s more, there’s a wide range of customization options, so you can really make the Dell XPS 13 the best laptop for your needs. ",
        "rating": 4.3
    },
    {
        "id": "3",
        "productName": "Asus ZenBook Flip S",
        "image": "asus-zenbook-flip-s.jpg",
        "cpu": "Intel Core i7, 8th generation",
        "ram": "16GB",
        "storage": "512 GB SSD",
        "screen": "13.3-inch, Full HD touchscreen",
        "price": "1399",
        "description": "Asus has struck gold with its new refresh of its ZenBook Flip S 2-in-1 laptop. With a new Kaby Lake R 8th-generation processor powering the device, plenty of RAM and a super-fast PCIe SSD in certain models, this is an absolutely stunning laptop. Its 2-in-1 design means you can use it as both a laptop and a tablet, and while it's not as affordable as some other machines, if you have the budget you'll be really happy with this fantastic device.",
        "rating": 4.6
    },
    {
        "id": "4",
        "productName": "Samsung Notebook 9",
        "image": "samsung-notebook-9.jpg",
        "cpu": "Intel Core i7, 8th generation",
        "ram": "16GB",
        "storage": "256 GB SSD",
        "screen": "15-inch, Full HD",
        "price": "1499",
        "description": "While it may not have the best keyboard in the world, the Samsung Notebook 9 is still one of the best laptops you can buy in 2018. Packed with more horsepower than some MacBook Pros,but at a much lower price, Samsung has crafted a laptop that has just as much substance as it does style. Plus, on top of its killer specs, it’s lightweight and thin, making this one of the most portable 15-inch laptops you can buy today.",
        "rating": 4.2
    },
    {
        "id": "5",
        "productName": "Microsoft Surface Laptop 4",
        "image": "microsoft-surface-laptop-4.jpg",
        "cpu": "AMD Ryzen 7 4980U",
        "ram": "16GB",
        "storage": "512GB SSD",
        "screen": "13.5-inch PixelSense Display",
        "price": "1699",
        "description": "The Microsoft Surface Laptop 4 brings improved performance with the latest AMD Ryzen processors while maintaining its sleek design and excellent build quality. With a vibrant display and comfortable keyboard, it's an ideal choice for productivity and everyday use.",
        "rating": 4.4
    },
    {
        "id": "6",
        "productName": "Lenovo ThinkPad X1 Carbon Gen 9",
        "image": "lenovo-thinkpad-x1-carbon-gen9.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "16GB",
        "storage": "1TB SSD",
        "screen": "14-inch, 4K UHD",
        "price": "2199",
        "description": "The Lenovo ThinkPad X1 Carbon Gen 9 is a powerhouse business laptop with a lightweight and durable design. Featuring a stunning 4K display, powerful performance, and an excellent keyboard, it's the perfect choice for professionals on the go.",
        "rating": 4.8
    },
    {
        "id": "7",
        "productName": "HP Spectre x360 14",
        "image": "hp-spectre-x360-14.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "16GB",
        "storage": "512GB SSD",
        "screen": "13.5-inch OLED Touchscreen",
        "price": "1799",
        "description": "The HP Spectre x360 14 is a versatile 2-in-1 laptop with a stunning OLED display and exceptional performance. With its sleek design, long battery life, and convertible form factor, it's perfect for both work and entertainment.",
        "rating": 4.7
    },
    {
        "id": "8",
        "productName": "Acer Swift 5",
        "image": "acer-swift-5.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "16GB",
        "storage": "1TB SSD",
        "screen": "14-inch, Full HD",
        "price": "1299",
        "description": "The Acer Swift 5 is an ultraportable laptop with a powerful 11th gen Intel Core processor and a lightweight design. With its long battery life and vibrant display, it's perfect for productivity on the go.",
        "rating": 4.1
    },
    {
        "id": "9",
        "productName": "Razer Blade 15",
        "image": "razer-blade-15.jpg",
        "cpu": "Intel Core i7, 10th generation",
        "ram": "16GB",
        "storage": "512GB SSD",
        "screen": "15.6-inch, Full HD 300Hz",
        "price": "1999",
        "description": "The Razer Blade 15 is a powerful gaming laptop with a sleek design and high-refresh-rate display. With its premium build quality and powerful specs, it's perfect for gamers and content creators alike.",
        "rating": 4.9
    },
    {
        "id": "10",
        "productName": "Alienware m15 R6",
        "image": "alienware-m15-r6.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "32GB",
        "storage": "1TB SSD",
        "screen": "15.6-inch, QHD 240Hz",
        "price": "2799",
        "description": "The Alienware m15 R6 is a high-performance gaming laptop with cutting-edge hardware and a stunning display. With its powerful specs and customizable RGB lighting, it's the ultimate gaming machine for enthusiasts.",
        "rating": 4.6
    },
    {
        "id": "11",
        "productName": "MSI GS66 Stealth",
        "image": "msi-gs66-stealth.jpg",
        "cpu": "Intel Core i9, 11th generation",
        "ram": "32GB",
        "storage": "1TB SSD",
        "screen": "15.6-inch, Full HD 300Hz",
        "price": "2999",
        "description": "The MSI GS66 Stealth is a premium gaming laptop with a sleek design and powerful hardware. With its high-refresh-rate display and advanced cooling system, it's perfect for hardcore gamers who demand the best performance.",
        "rating": 4.7
    },
    {
        "id": "12",
        "productName": "Gigabyte Aero 15 OLED",
        "image": "gigabyte-aero-15-oled.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "16GB",
        "storage": "1TB SSD",
        "screen": "15.6-inch, 4K OLED",
        "price": "2499",
        "description": "The Gigabyte Aero 15 OLED is a premium laptop with a stunning 4K OLED display and powerful hardware. With its sleek design and long battery life, it's perfect for content creators and professionals who demand the best.",
        "rating": 4.8
    },
    {
        "id": "13",
        "productName": "LG Gram 17",
        "image": "lg-gram-17.jpg",
        "cpu": "Intel Core i7, 11th generation",
        "ram": "16GB",
        "storage": "1TB SSD",
        "screen": "17-inch, WQXGA",
        "price": "1899",
        "description": "The LG Gram 17 is an ultraportable laptop with a large 17-inch display and long battery life. With its lightweight design and powerful hardware, it's perfect for professionals who need a large screen for productivity on the go.",
        "rating": 4.5
    },
    {
        "id": "14",
        "productName": "Lenovo Legion 7i",
        "image": "lenovo-legion-7i.jpg",
        "cpu": "Intel Core i9, 11th generation",
        "ram": "32GB",
        "storage": "1TB SSD",
        "screen": "15.6-inch, Full HD 240Hz",
        "price": "2799",
        "description": "The Lenovo Legion 7i is a premium gaming laptop with a sleek design and powerful hardware. With its high-refresh-rate display and advanced cooling system, it's perfect for gamers who demand the best performance.",
        "rating": 4.6
    }
]
